src/InformationRegisters/ВремяПоследнегоОповещения/ВремяПоследнегоОповещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВремяПоследнегоОповещения</name>
  <resources>
    <name>Время</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗадачи</name>
    <type>
      <types>CatalogRef.ТипыЗадачКонтрольМониторингСистемныхОшибок</types>
      <types>CatalogRef.ТипыЗадачСборДампов</types>
      <types>CatalogRef.ТипыЗадач</types>
      <types>CatalogRef.ТипыЗадачОценкаПользователей</types>
      <types>CatalogRef.ТипыЗадачКонтрольПроизводительности</types>
      <types>String</types>
      <types>CatalogRef.ТипыЗадачКонтрольПамяти</types>
      <types>CatalogRef.ТипыЗадачКонтрольНагрузочныхТестов</types>
      <types>CatalogRef.ТипыЗадачКонтрольПодключений</types>
      <types>CatalogRef.ТипыЗадачВнешнийКонтрольЦКК</types>
      <types>CatalogRef.ТипыЗадачКонтрольРегламентныхЗаданий</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ВремяПоследнегоОповещения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ДобавитьЗапись(КонтрольнаяПроцедура, ТипЗадачи, ДатаИВремя) Экспорт
	МенеджерЗаписи = РегистрыСведений.ВремяПоследнегоОповещения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
	МенеджерЗаписи.ТипЗадачи = ТипЗадачи;
	МенеджерЗаписи.Время = ДатаИВремя;
	МенеджерЗаписи.Записать();
КонецПроцедуры

#КонецЕсли
